# import libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
data = pd.read_csv('Salary Prediction of Data Professions.csv')

## Exploratory Data Analysis (EDA)

In [3]:
data.head()

,FIRST NAME,LAST NAME,SEX,DOJ,CURRENT DATE,DESIGNATION,AGE,SALARY,UNIT,LEAVES USED,LEAVES REMAINING,RATINGS,PAST EXP
0,TOMASA,ARMEN,F,5-18-2014,01-07-2016,Analyst,21.0,44570,Finance,24.0,6.0,2.0,0
1,ANNIE,NaN,F,NaN,01-07-2016,Associate,NaN,89207,Web,NaN,13.0,NaN,7
2,OLIVE,ANCY,F,7-28-2014,01-07-2016,Analyst,21.0,40955,Finance,23.0,7.0,3.0,0
3,CHERRY,AQUILAR,F,04-03-2013,01-07-2016,Analyst,22.0,45550,IT,22.0,8.0,3.0,0
4,LEON,ABOULAHOUD,M,11-20-2014,01-07-2016,Analyst,NaN,43161,Operations,27.0,3.0,NaN,3

### Summary Statistics

In [4]:
data.describe()

,AGE,SALARY,LEAVES USED,LEAVES REMAINING,RATINGS,PAST EXP
count,2636.000000,2639.000000,2636.000000,2637.000000,2637.000000,2639.000000
mean,24.756449,58136.678287,22.501517,7.503223,3.486159,1.566881
std,3.908228,36876.956944,4.604469,4.603193,1.114933,2.728416
min,21.000000,40001.000000,15.000000,0.000000,2.000000,0.000000
25%,22.000000,43418.000000,19.000000,4.000000,2.000000,0.000000
50%,24.000000,46781.000000,22.000000,8.000000,3.000000,1.000000
75%,25.000000,51401.500000,26.000000,11.000000,4.000000,2.000000
max,45.000000,388112.000000,30.000000,15.000000,5.000000,23.000000

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2639 entries, 0 to 2638
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   FIRST NAME        2639 non-null   object
 1   LAST NAME         2637 non-null   object
 2   SEX               2639 non-null   object
 3   DOJ               2638 non-null   object
 4   CURRENT DATE      2639 non-null   object
 5   DESIGNATION       2639 non-null   object
 6   AGE               2636 non-null   float64
 7   SALARY            2639 non-null   int64
 8   UNIT              2639 non-null   object
 9   LEAVES USED       2636 non-null   float64
 10  LEAVES REMAINING  2637 non-null   float64
 11  RATINGS           2637 non-null   float64
 12  PAST EXP          2639 non-null   int64
dtypes: float64(4), int64(2), object(7)
memory usage: 268.2+ KB

## Data cleaning

In [8]:
missing_val = data.isnull().sum()
missing_val

FIRST NAME          0
LAST NAME           2
SEX                 0
DOJ                 1
CURRENT DATE        0
DESIGNATION         0
AGE                 3
SALARY              0
UNIT                0
LEAVES USED         3
LEAVES REMAINING    2
RATINGS             2
PAST EXP            0
dtype: int64

In [9]:
data['DOJ'] = pd.to_datetime(data['DOJ'], errors='coerce')
data['CURRENT DATE'] = pd.to_datetime(data['CURRENT DATE'], errors='coerce')

In [11]:
data.dtypes

FIRST NAME                  object
LAST NAME                   object
SEX                         object
DOJ                 datetime64[ns]
CURRENT DATE        datetime64[ns]
DESIGNATION                 object
AGE                        float64
SALARY                       int64
UNIT                        object
LEAVES USED                float64
LEAVES REMAINING           float64
RATINGS                    float64
PAST EXP                     int64
dtype: object

In [14]:
# Update the 'LAST NAME' column
data.loc[data['LAST NAME'].isnull(), 'LAST NAME'] = 'Unknown'

# Drop rows where 'DOJ' is NaN
data = data.dropna(subset=['DOJ'])

# Update the 'AGE' column
data['AGE'] = data['AGE'].fillna(data['AGE'].median())

# Update the 'LEAVES USED' column
data['LEAVES USED'] = data['LEAVES USED'].fillna(data['LEAVES USED'].median())

# Update the 'LEAVES REMAINING' column
data['LEAVES REMAINING'] = data['LEAVES REMAINING'].fillna(data['LEAVES REMAINING'].median())

# Update the 'RATINGS' column
data['RATINGS'] = data['RATINGS'].fillna(data['RATINGS'].median())

## Visualization